JuneJulyAugust/openotter/firmware/stm32-mcp/Core/Src/main.c
  /* Register the ToF GATT service (FE60). Must follow BLE_App_Init so the
   * BlueNRG stack and SVCCTL are already up. */
  boot_log_str("BOOT phase=ble_tof_init\r\n");
  BLE_Tof_Init();
  boot_log_fmt("BOOT phase=services_ready tick=%lu\r\n",
               (unsigned long)HAL_GetTick());

  /* Stamp the stack-bottom sentinel BEFORE the main loop starts pushing
   * frames. If recursion or a deep call chain ever overwrites it, the
   * check below catches the corruption before it manifests as something
   * harder to triage. */
  FwStackGuard_Init();

  /* Configure the MPU's hardware no-access region immediately below the
   * stack sentinel. Any push past the configured stack bottom traps as
   * MemManage on the offending instruction; the sentinel remains readable
   * for the cheap main-loop backup check below. */
  FwMpu_Init();

  /* Start the independent watchdog after fast startup init paths have run.
   * The window is sized to tolerate lazy VL53L8CX boot from the main loop.
   * From this point on, any main-loop iteration that exceeds the watchdog
   * window reboots the chip — last-resort recovery from a hung BLE stack,
   * blocked I²C transaction, or any other stuck-loop bug. */
  FwWatchdog_Init();
  boot_log_fmt("BOOT phase=main_loop_enter tick=%lu\r\n",
               (unsigned long)HAL_GetTick());
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  uint32_t loop_iter = 0;
  uint32_t last_loop_log_tick = 0;
  while (1) {
    /* Refresh the watchdog at the top of every iteration. If we never get
     * back here (e.g. BLE_App_Process or TofL8_Process spins forever), the
     * IWDG fires after its configured window and resets the chip. */
    FwWatchdog_Refresh();
    loop_iter++;

    /* 1 Hz main-loop heartbeat. If the loop ever freezes after a successful
     * boot, the absence of this line in the UART log isolates the freeze to
     * one of the four Process() calls below (or whatever was running between
     * the last heartbeat and the freeze). Cheap: one HAL_GetTick + one
     * subtract per iteration. */
    {
      uint32_t now_hb = HAL_GetTick();
      if ((now_hb - last_loop_log_tick) >= 1000u) {
        boot_log_fmt("LOOP iter=%lu tick=%lu\r\n",
                     (unsigned long)loop_iter, (unsigned long)now_hb);
        last_loop_log_tick = now_hb;
      }
    }

    /* Cheap stack-overflow check (single mem read + compare). If the
     * sentinel is gone, the stack region has been written past its
     * configured bottom — panic-reboot now, before the corruption
     * causes downstream chaos in code we can't reason about. */
    if (!FwStackGuard_Check()) {
      Firmware_Panic(FW_PANIC_STACK);
    }

    BLE_App_Process();
    TofL8_Process();
    /* BLE_Tof_Process is mode-gated: in Drive mode (default) frame
     * notifications are suppressed; in Debug mode they stream normally. */
    BLE_Tof_Process();

    /* Toggle LED2 (PB14) at 1 Hz while VL53L8CX frames are arriving. */
    static uint32_t last_l8_seq = 0;
    static uint32_t last_l8_frame_tick = 0;
    static uint32_t last_l8_led_toggle = 0;
    uint32_t now = HAL_GetTick();
    const Tof_Frame_t *l8_frame = TofL8_GetLatestFrame();
    if (l8_frame && l8_frame->seq != 0u && l8_frame->seq != last_l8_seq) {
      last_l8_seq = l8_frame->seq;
      last_l8_frame_tick = now;
    }
    if (last_l8_frame_tick != 0u && (now - last_l8_frame_tick) <= 1500u) {
      if ((now - last_l8_led_toggle) >= 1000u) {
        HAL_GPIO_TogglePin(LED2_GPIO_Port, LED2_Pin);
        last_l8_led_toggle = now;
      }
    } else {
      HAL_GPIO_WritePin(LED2_GPIO_Port, LED2_Pin, GPIO_PIN_RESET);
    }
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
 * @brief System Clock Configuration
 * @retval None
 */
void SystemClock_Config(void) {
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
   */
  if (HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1) != HAL_OK) {
    Error_Handler();
  }

  /** Configure LSE Drive Capability
   */
  HAL_PWR_EnableBkUpAccess();
  __HAL_RCC_LSEDRIVE_CONFIG(RCC_LSEDRIVE_LOW);

  /** Initializes the RCC Oscillators according to the specified parameters
   * in the RCC_OscInitTypeDef structure.
   */
  RCC_OscInitStruct.OscillatorType =
      RCC_OSCILLATORTYPE_LSE | RCC_OSCILLATORTYPE_MSI;
  RCC_OscInitStruct.LSEState = RCC_LSE_ON;
  RCC_OscInitStruct.MSIState = RCC_MSI_ON;
  RCC_OscInitStruct.MSICalibrationValue = 0;
  RCC_OscInitStruct.MSIClockRange = RCC_MSIRANGE_6;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_MSI;
  RCC_OscInitStruct.PLL.PLLM = 1;
  RCC_OscInitStruct.PLL.PLLN = 40;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV7;
  RCC_OscInitStruct.PLL.PLLQ = RCC_PLLQ_DIV2;
  RCC_OscInitStruct.PLL.PLLR = RCC_PLLR_DIV2;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
   */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK |
                                RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_4) != HAL_OK) {
    Error_Handler();
  }

  /** Enable MSI Auto calibration
   */
  HAL_RCCEx_EnableMSIPLLMode();
}

/**
 * @brief DFSDM1 Initialization Function
 * @param None
 * @retval None
 */
static void MX_DFSDM1_Init(void) {

  /* USER CODE BEGIN DFSDM1_Init 0 */

  /* USER CODE END DFSDM1_Init 0 */

  /* USER CODE BEGIN DFSDM1_Init 1 */

  /* USER CODE END DFSDM1_Init 1 */
  hdfsdm1_channel1.Instance = DFSDM1_Channel1;
  hdfsdm1_channel1.Init.OutputClock.Activation = ENABLE;
  hdfsdm1_channel1.Init.OutputClock.Selection =
      DFSDM_CHANNEL_OUTPUT_CLOCK_SYSTEM;
  hdfsdm1_channel1.Init.OutputClock.Divider = 2;
  hdfsdm1_channel1.Init.Input.Multiplexer = DFSDM_CHANNEL_EXTERNAL_INPUTS;
  hdfsdm1_channel1.Init.Input.DataPacking = DFSDM_CHANNEL_STANDARD_MODE;
  hdfsdm1_channel1.Init.Input.Pins = DFSDM_CHANNEL_FOLLOWING_CHANNEL_PINS;
  hdfsdm1_channel1.Init.SerialInterface.Type = DFSDM_CHANNEL_SPI_RISING;
  hdfsdm1_channel1.Init.SerialInterface.SpiClock =
      DFSDM_CHANNEL_SPI_CLOCK_INTERNAL;
  hdfsdm1_channel1.Init.Awd.FilterOrder = DFSDM_CHANNEL_FASTSINC_ORDER;
  hdfsdm1_channel1.Init.Awd.Oversampling = 1;
  hdfsdm1_channel1.Init.Offset = 0;
  hdfsdm1_channel1.Init.RightBitShift = 0x00;
  if (HAL_DFSDM_ChannelInit(&hdfsdm1_channel1) != HAL_OK) {
    Error_Handler();
  }
  /* USER CODE BEGIN DFSDM1_Init 2 */

  /* USER CODE END DFSDM1_Init 2 */
}

/**
 * @brief I2C2 Initialization Function
 * @param None
 * @retval None
 */
static void MX_I2C2_Init(void) {

